convertigo-templates/lib_Salesforce/soap-templates/SoapBinding/CdescribeDataCategoryGroupStructures.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:partner.soap.sforce.com">
   <soapenv:Header>
      <urn:LocaleOptions>
         <!--Optional:-->
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:language>$(HEADER_LOCALEOPTIONS_LANGUAGE)</urn:language>
      </urn:LocaleOptions>
      <urn:PackageVersionHeader>
         <!--Zero or more repetitions:-->
         <urn:packageVersions>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:majorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MAJORNUMBER)</urn:majorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}int-->
            <urn:minorNumber>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_MINORNUMBER)</urn:minorNumber>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:namespace>$(HEADER_PACKAGEVERSIONHEADER_PACKAGEVERSIONS_NAMESPACE)</urn:namespace>
         </urn:packageVersions>
      </urn:PackageVersionHeader>
      <urn:CallOptions>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:client>$(HEADER_CALLOPTIONS_CLIENT)</urn:client>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:defaultNamespace>$(HEADER_CALLOPTIONS_DEFAULTNAMESPACE)</urn:defaultNamespace>
      </urn:CallOptions>
      <urn:SessionHeader>
         <!--type: {http://www.w3.org/2001/XMLSchema}string-->
         <urn:sessionId>$(HEADER_SESSIONHEADER_SESSIONID)</urn:sessionId>
      </urn:SessionHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:describeDataCategoryGroupStructures>
         <!--0 to 100 repetitions:-->
         <urn:pairs>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:dataCategoryGroupName>$(BODY_DESCRIBEDATACATEGORYGROUPSTRUCTURES_PAIRS_DATACATEGORYGROUPNAME)</urn:dataCategoryGroupName>
            <!--type: {http://www.w3.org/2001/XMLSchema}string-->
            <urn:sobject>$(BODY_DESCRIBEDATACATEGORYGROUPSTRUCTURES_PAIRS_SOBJECT)</urn:sobject>
         </urn:pairs>
         <!--type: {http://www.w3.org/2001/XMLSchema}boolean-->
         <urn:topCategoriesOnly>$(BODY_DESCRIBEDATACATEGORYGROUPSTRUCTURES_TOPCATEGORIESONLY)</urn:topCategoriesOnly>
      </urn:describeDataCategoryGroupStructures>
   </soapenv:Body>
</soapenv:Envelope>